Repository: AlertRED/telegram-language-bot
Catalog: bot/locales/*/LC_MESSAGES/messages.po
Languages: ru

source: 🌱 Main menu
ru: 🌱 Главное меню

source: 🏋️ Train words from set
ru: 🏋️ Тренировать слова

source: ✍️ Add new term, set or folder
ru: ✍️ Новый термин, коллекция или папка

source: 🗂 Change term, set or folder
ru: 🗂 Изменить термин, коллекцию или папку

source: ⚙️ Your settings
ru: ⚙️ Настройки

source: Write set name
ru: Введите название коллекции

source: The collection <b><u>{collection_name}</u></b> is already exists in the folder {folder_name}!
ru: Коллекция <b><u>{collection_name}</u></b> уже существует в папке <b><u>{folder_name}</u></b>

source: Set <b><u>{collection_name}</u></b> added into <b><u>{folder_name}</u></b> folder
ru: Коллекция <b><u>{collection_name}</u></b> добавлена в папку<b><u>{folder_name}</u></b>

source: Root
ru: Корневую папку

source: Write folder name
ru: Введите название папки

source: Folder <b><u>{new_folder_name}</u></b> added into folder <b><u>{folder_name}</u></b>
ru: Папка <b><u>{new_folder_name}</u></b> добавлена в папку <b><u>{folder_name}</u></b>

source: Write term
ru: Введите термин

source: Term added into {collection_name} Term: <b><u>{term_name}</u></b> Description: {term_description}
ru: Термин добавлен в {collection_name} Термин: <b><u>{term_name}</u></b> Определение: {term_description}

source: The term length should not be more than {max_length}!
ru: Длина термина не может быть больше чем {max_length}!

source: The term <b><u>{term_name}</u></b> is already exists in the collection {collection_name}!
ru: Термин <u><b>{term_name}</b></u> уже существует в {collection_name}

source: Or choose one from suggestions {text_suggestions}
ru: Или выберите из предложенных {text_suggestions}

source: We coudn't find any suggestion...
ru: Мы не смогли найти определений...

source: Write description for <b><u>{term_name}</u></b> {text_suggestions}
ru: Напишите описание для <b><u>{term_name}</u></b> {text_suggestions}

source: The definition length should not be more than {max_length}!
ru: Определение не может быть больше чем {max_length}!

source: Add term
ru: Добавить термин

source: Add set
ru: Добавить коллекцию

source: Add folder
ru: Добавить папку

source: Type item to add
ru: Введите термин

source: Collection <u><b>{collection_name}</b></u> deleted succesfully!
ru: Коллекция <u><b>{collection_name}</b></u> успешно удалена!

source: Are you sure you wanna delete <u><b>{collection_name}</b></u>? All terms inside will be deleted too!
ru: Вы уверены что хотите удалить <u><b>{collection_name}</b></u>? Все входящие термины будут также удалены!

source: Yes
ru: Да

source: No
ru: Нет

source: {additional_text} Manage set <u><b>{collection_name}</b></u>
ru: {additional_text} Изменить коллекцию <u><b>{collection_name}</b></u>

source: Change name
ru: Изменить название

source: Move set
ru: Переместить

source: Delete set
ru: Удалить

source: Change term
ru: Изменить термин

source: {collection_name} was moved to {folder_name}
ru: {collection_name} была перемещена в {folder_name}

source: Are you sure wanna move <u><b>{collection_name}</b></u> into <u><b>{folder_name}</b></u>?
ru: Вы уверены, что хотите переместить <u><b>{collection_name}</b></u> в <u><b>{folder_name}</b></u>?

source: Write new name (old name {collection_name}):
ru: Введите новое имя (старое имя {collection_name}):

source: Collection name <u><b>{collection_name}</b></u> changed to <u><b>{new_name}</b></u>
ru: Название коллекции <u><b>{collection_name}</b></u> изменено на <u><b>{new_name}</b></u>

source: Folder <u><b>{folder_name}</b></u> deleted succesfully!
ru: Папка <u><b>{folder_name}</b></u> успешно удалена!

source: Are you sure you wanna delete <u><b>{folder_name}</b></u>? All sets inside will be deleted too!
ru: Вы уверены что хотите удалить <u><b>{folder_name}</b></u>? Все входящие коллекции будут также удалены!

source: {additional_text}Manage folder <u><b>{folder_name}</b></u>
ru: {additional_text}Изменить папку <u><b>{folder_name}</b></u>

source: Move folder
ru: Переместить

source: Delete folder
ru: Удалить

source: {folder_name} was moved to {selected_folder_name}
ru: {folder_name} была перемещена в {selected_folder_name}

source: Are you sure wanna move <u><b>{folder_name}</b></u> into <u><b>{selected_folder_name}</b></u>?
ru: Вы уверены что хотите переместить <u><b>{folder_name}</b></u> в <u><b>{selected_folder_name}</b></u>?

source: Write new name (old name {folder_name}):
ru: Введите новое имя (старое имя {folder_name}):

source: Folder name <u><b>{folder_name}</b></u> changed to <u><b>{new_name}</b></u>
ru: Название папки <u><b>{folder_name}</b></u> изменено на <u><b>{new_name}</b></u>

source: Manage folder
ru: Переместить

source: Manage set / term
ru: Изменить термин

source: Choose item to manage
ru: Выберите язык

source: Write new definition(old definition is {term_description}):
ru: Введите новое определение(старое определение{term_description}):

source: Term was changed successfully!
ru: Термин изменен успешно!

source: Write new name (old name is {term_name}):
ru: Введите новое имя (старое имя {term_name}):

source: Term <u><b>{term_name}</b></u> deleted succesfully!
ru: Термин <u><b>{term_name}</b></u> удален успешно!

source: Are you sure you wanna delete <u><b>{term_name}</b></u>?
ru: Вы уверены что хотите удалить <u><b>{term_name}</b></u>?

source: <u><b>{collection_name}</b></u> doesn't have terms yet.
ru: В коллекции <u><b>{collection_name}</b></u> еще нет терминов.

source: Change definition
ru: Изменить определение

source: Delete term
ru: Удалить термин

source: Move term
ru: Переместить термин

source: <u><b>{term_name}</b></u> was moved to {collection_name}
ru: <u><b>{term_name}</b></u> был перемещен {collection_name}

source: Are you sure wanna move <u><b>{term_name}</b></u> into <u><b>{collection_name}</b></u>?
ru: Вы уверены, что хотите переместить <u><b>{term_name}</b></u> в <u><b>{collection_name}</b></u>?

source: Hi, {username}! I'll help you to learn any language. Bot commands: /train - 🏋️ train words from set /add_item - ✍️ add new term, set or folder /manage_item - 🗂 change term, set or folder /settings - ⚙️ your settings
ru: Привет, {username}! Я помогу тебе в изучении языков. Команды бота: /train - 🏋️ начать тренировку /add_item - ✍️ добавить термин, коллекцию или папку /manage_item - 🗂 изменить термин, коллекцию или папку /settings - ⚙️ настройки

source: Back
ru: Назад

source: Choose language
ru: Выберите язык

source: Language was changed!
ru: Язык успешно изменен!

source: Change language
ru: Изменить язык

source: Settings
ru: Настройки

source: Tools
ru: Инструменты

source: Load test data
ru: Тестовые данные

source: Show structure
ru: Вывести структуру

source: Task
ru: Задача

source: Choose user
ru: Выбрать текущую

source: My
ru: Для меня

source: Other
ru: Для другого

source: {additional_text} Write user id
ru: {additional_text} Введите id пользователя

source: User id must be digit!
ru: Id пользователя должно быть числом!

source: Another
ru: Для другого

source: Data added to user #{user_id}
ru: Данные для пользователя #{user_id} добавлены

source: Sorry, set must contains more than <b>{min_terms_count}</b> terms, set <b><u>{collection_name}</u></b> has <b>{term_counts}</b> terms
ru: Извините, коллекция должна содержать больше чем <b>{min_terms_count}</b> терминов, коллекция <b><u>{collection_name}</u></b> имеет только <b>{term_counts}</b> терминов

source: Time was expired :(
ru: Время истекло :(

source: Wins: {wins_count} | Loses: {lose_count} Accuracy: {accuracy:.1%}
ru: Победы: {wins_count} | Проигрыши: {lose_count} Точность: {accuracy:.1%}

source: Try again
ru: Попробовать снова

source: Find definition
ru: Найти определение

source: Simple train
ru: Простая тренировка

source: Choose train type
ru: Выберите тренировку

source: Finished!
ru: Закончено!

source: Ok
ru: Ок

source: Remind me
ru: Напомнить

source: I know
ru: Я знаю

source: Choose set [{current_page}/{last_page}]
ru: Выберите коллекцию [{current_page}/{last_page}]

source: Choose current
ru: Выбрать текущую

source: Choose folder <u><b>{root_name}</b></u> page [{current_page}/{last_page}]
ru: Выбор папки <u><b>{root_name}</b></u> страница [{current_page}/{last_page}]
